In [1]:
import pandas as pd

In [2]:
data = {
    "Region": ["Q", "B", "M", "M", "B", "B", "B", "Q"],
    "Rooms": [1, 3, 2, 1, 2, 1, 1, 1],
    "Area": [70, 120, 90, 85, 100, 55, 75, 68],
    "price(1000$)": [43, 20, 32, 15, 60, 42, 19, 23]
}
df = pd.DataFrame(data)
df

  Region  Rooms  Area  price(1000$)
0      Q      1    70            43
1      B      3   120            20
2      M      2    90            32
3      M      1    85            15
4      B      2   100            60
5      B      1    55            42
6      B      1    75            19
7      Q      1    68            23

In [4]:
df.groupby("Region").groups

{'B': [1, 4, 5, 6], 'M': [2, 3], 'Q': [0, 7]}

In [5]:
df.groupby(["Region", "Rooms"]).groups

{('B', 1): [5, 6], ('B', 2): [4], ('B', 3): [1], ('M', 1): [3], ('M', 2): [2], ('Q', 1): [0, 7]}

In [10]:
for g_name, group in df.groupby("Region"):
    print(g_name)
    print(group)

B
  Region  Rooms  Area  price(1000$)
1      B      3   120            20
4      B      2   100            60
5      B      1    55            42
6      B      1    75            19
M
  Region  Rooms  Area  price(1000$)
2      M      2    90            32
3      M      1    85            15
Q
  Region  Rooms  Area  price(1000$)
0      Q      1    70            43
7      Q      1    68            23

In [12]:
df.groupby("Region").get_group("B")

  Region  Rooms  Area  price(1000$)
1      B      3   120            20
4      B      2   100            60
5      B      1    55            42
6      B      1    75            19

In [13]:
df.groupby(["Region", "Rooms"]).get_group(("B", 1))

  Region  Rooms  Area  price(1000$)
5      B      1    55            42
6      B      1    75            19

In [14]:
import numpy as np

In [17]:
df.groupby("Region").aggregate(sum)

        Rooms  Area  price(1000$)
Region
B           7   350           141
M           3   175            47
Q           2   138            66

In [18]:
df.groupby("Region").aggregate(np.mean)

        Rooms  Area  price(1000$)
Region
B        1.75  87.5         35.25
M        1.50  87.5         23.50
Q        1.00  69.0         33.00